Microchip-MPLAB-Harmony/csp/apps/trustZone/systick/NonSecure/firmware/src/packs/ATSAML11E16A_DFP/component/opamp.h
/* -------- OPAMP_OPAMPCTRL1 : (OPAMP Offset: 0x08) (R/W 32) OPAMP1 Control -------- */
#define OPAMP_OPAMPCTRL1_RESETVALUE           _U_(0x00)                                            /**<  (OPAMP_OPAMPCTRL1) OPAMP1 Control  Reset Value */

#define OPAMP_OPAMPCTRL1_ENABLE_Pos           _U_(1)                                               /**< (OPAMP_OPAMPCTRL1) Operational Amplifier Enable Position */
#define OPAMP_OPAMPCTRL1_ENABLE_Msk           (_U_(0x1) << OPAMP_OPAMPCTRL1_ENABLE_Pos)            /**< (OPAMP_OPAMPCTRL1) Operational Amplifier Enable Mask */
#define OPAMP_OPAMPCTRL1_ENABLE(value)        (OPAMP_OPAMPCTRL1_ENABLE_Msk & ((value) << OPAMP_OPAMPCTRL1_ENABLE_Pos))
#define OPAMP_OPAMPCTRL1_ANAOUT_Pos           _U_(2)                                               /**< (OPAMP_OPAMPCTRL1) Analog Output Position */
#define OPAMP_OPAMPCTRL1_ANAOUT_Msk           (_U_(0x1) << OPAMP_OPAMPCTRL1_ANAOUT_Pos)            /**< (OPAMP_OPAMPCTRL1) Analog Output Mask */
#define OPAMP_OPAMPCTRL1_ANAOUT(value)        (OPAMP_OPAMPCTRL1_ANAOUT_Msk & ((value) << OPAMP_OPAMPCTRL1_ANAOUT_Pos))
#define OPAMP_OPAMPCTRL1_BIAS_Pos             _U_(3)                                               /**< (OPAMP_OPAMPCTRL1) Bias Selection Position */
#define OPAMP_OPAMPCTRL1_BIAS_Msk             (_U_(0x3) << OPAMP_OPAMPCTRL1_BIAS_Pos)              /**< (OPAMP_OPAMPCTRL1) Bias Selection Mask */
#define OPAMP_OPAMPCTRL1_BIAS(value)          (OPAMP_OPAMPCTRL1_BIAS_Msk & ((value) << OPAMP_OPAMPCTRL1_BIAS_Pos))
#define OPAMP_OPAMPCTRL1_RES2VCC_Pos          _U_(5)                                               /**< (OPAMP_OPAMPCTRL1) Resistor ladder To VCC Position */
#define OPAMP_OPAMPCTRL1_RES2VCC_Msk          (_U_(0x1) << OPAMP_OPAMPCTRL1_RES2VCC_Pos)           /**< (OPAMP_OPAMPCTRL1) Resistor ladder To VCC Mask */
#define OPAMP_OPAMPCTRL1_RES2VCC(value)       (OPAMP_OPAMPCTRL1_RES2VCC_Msk & ((value) << OPAMP_OPAMPCTRL1_RES2VCC_Pos))
#define OPAMP_OPAMPCTRL1_RUNSTDBY_Pos         _U_(6)                                               /**< (OPAMP_OPAMPCTRL1) Run in Standby Position */
#define OPAMP_OPAMPCTRL1_RUNSTDBY_Msk         (_U_(0x1) << OPAMP_OPAMPCTRL1_RUNSTDBY_Pos)          /**< (OPAMP_OPAMPCTRL1) Run in Standby Mask */
#define OPAMP_OPAMPCTRL1_RUNSTDBY(value)      (OPAMP_OPAMPCTRL1_RUNSTDBY_Msk & ((value) << OPAMP_OPAMPCTRL1_RUNSTDBY_Pos))
#define OPAMP_OPAMPCTRL1_ONDEMAND_Pos         _U_(7)                                               /**< (OPAMP_OPAMPCTRL1) On Demand Control Position */
#define OPAMP_OPAMPCTRL1_ONDEMAND_Msk         (_U_(0x1) << OPAMP_OPAMPCTRL1_ONDEMAND_Pos)          /**< (OPAMP_OPAMPCTRL1) On Demand Control Mask */
#define OPAMP_OPAMPCTRL1_ONDEMAND(value)      (OPAMP_OPAMPCTRL1_ONDEMAND_Msk & ((value) << OPAMP_OPAMPCTRL1_ONDEMAND_Pos))
#define OPAMP_OPAMPCTRL1_RES2OUT_Pos          _U_(8)                                               /**< (OPAMP_OPAMPCTRL1) Resistor ladder To Output Position */
#define OPAMP_OPAMPCTRL1_RES2OUT_Msk          (_U_(0x1) << OPAMP_OPAMPCTRL1_RES2OUT_Pos)           /**< (OPAMP_OPAMPCTRL1) Resistor ladder To Output Mask */
#define OPAMP_OPAMPCTRL1_RES2OUT(value)       (OPAMP_OPAMPCTRL1_RES2OUT_Msk & ((value) << OPAMP_OPAMPCTRL1_RES2OUT_Pos))
#define OPAMP_OPAMPCTRL1_RES1EN_Pos           _U_(9)                                               /**< (OPAMP_OPAMPCTRL1) Resistor 1 Enable Position */
#define OPAMP_OPAMPCTRL1_RES1EN_Msk           (_U_(0x1) << OPAMP_OPAMPCTRL1_RES1EN_Pos)            /**< (OPAMP_OPAMPCTRL1) Resistor 1 Enable Mask */
#define OPAMP_OPAMPCTRL1_RES1EN(value)        (OPAMP_OPAMPCTRL1_RES1EN_Msk & ((value) << OPAMP_OPAMPCTRL1_RES1EN_Pos))
#define OPAMP_OPAMPCTRL1_RES1MUX_Pos          _U_(10)                                              /**< (OPAMP_OPAMPCTRL1) Resistor 1 Mux Position */
#define OPAMP_OPAMPCTRL1_RES1MUX_Msk          (_U_(0x7) << OPAMP_OPAMPCTRL1_RES1MUX_Pos)           /**< (OPAMP_OPAMPCTRL1) Resistor 1 Mux Mask */
#define OPAMP_OPAMPCTRL1_RES1MUX(value)       (OPAMP_OPAMPCTRL1_RES1MUX_Msk & ((value) << OPAMP_OPAMPCTRL1_RES1MUX_Pos))
#define   OPAMP_OPAMPCTRL1_RES1MUX_OAxPOS_Val _U_(0x0)                                             /**< (OPAMP_OPAMPCTRL1) Positive inout of OPAMPx  */
#define   OPAMP_OPAMPCTRL1_RES1MUX_OAxNEG_Val _U_(0x1)                                             /**< (OPAMP_OPAMPCTRL1) Negative input of OPAMPx  */
#define   OPAMP_OPAMPCTRL1_RES1MUX_OA0OUT_Val _U_(0x2)                                             /**< (OPAMP_OPAMPCTRL1) OPAMP0 output  */
#define   OPAMP_OPAMPCTRL1_RES1MUX_GND_Val    _U_(0x3)                                             /**< (OPAMP_OPAMPCTRL1) Ground  */
#define   OPAMP_OPAMPCTRL1_RES1MUX_RG_CONN_Val _U_(0x4)                                             /**< (OPAMP_OPAMPCTRL1) RG_CONN  */
#define OPAMP_OPAMPCTRL1_RES1MUX_OAxPOS       (OPAMP_OPAMPCTRL1_RES1MUX_OAxPOS_Val << OPAMP_OPAMPCTRL1_RES1MUX_Pos) /**< (OPAMP_OPAMPCTRL1) Positive inout of OPAMPx Position  */
#define OPAMP_OPAMPCTRL1_RES1MUX_OAxNEG       (OPAMP_OPAMPCTRL1_RES1MUX_OAxNEG_Val << OPAMP_OPAMPCTRL1_RES1MUX_Pos) /**< (OPAMP_OPAMPCTRL1) Negative input of OPAMPx Position  */
#define OPAMP_OPAMPCTRL1_RES1MUX_OA0OUT       (OPAMP_OPAMPCTRL1_RES1MUX_OA0OUT_Val << OPAMP_OPAMPCTRL1_RES1MUX_Pos) /**< (OPAMP_OPAMPCTRL1) OPAMP0 output Position  */
#define OPAMP_OPAMPCTRL1_RES1MUX_GND          (OPAMP_OPAMPCTRL1_RES1MUX_GND_Val << OPAMP_OPAMPCTRL1_RES1MUX_Pos) /**< (OPAMP_OPAMPCTRL1) Ground Position  */
#define OPAMP_OPAMPCTRL1_RES1MUX_RG_CONN      (OPAMP_OPAMPCTRL1_RES1MUX_RG_CONN_Val << OPAMP_OPAMPCTRL1_RES1MUX_Pos) /**< (OPAMP_OPAMPCTRL1) RG_CONN Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_Pos           _U_(13)                                              /**< (OPAMP_OPAMPCTRL1) Potentiometer Selection Position */
#define OPAMP_OPAMPCTRL1_POTMUX_Msk           (_U_(0x7) << OPAMP_OPAMPCTRL1_POTMUX_Pos)            /**< (OPAMP_OPAMPCTRL1) Potentiometer Selection Mask */
#define OPAMP_OPAMPCTRL1_POTMUX(value)        (OPAMP_OPAMPCTRL1_POTMUX_Msk & ((value) << OPAMP_OPAMPCTRL1_POTMUX_Pos))
#define   OPAMP_OPAMPCTRL1_POTMUX_14R_2R_Val  _U_(0x0)                                             /**< (OPAMP_OPAMPCTRL1) R1 = 14R, R2 = 2R  */
#define   OPAMP_OPAMPCTRL1_POTMUX_12R_4R_Val  _U_(0x1)                                             /**< (OPAMP_OPAMPCTRL1) R1 = 12R, R2 = 4R  */
#define   OPAMP_OPAMPCTRL1_POTMUX_8R_8R_Val   _U_(0x2)                                             /**< (OPAMP_OPAMPCTRL1) R1 = 8R, R2 = 8R  */
#define   OPAMP_OPAMPCTRL1_POTMUX_6R_10R_Val  _U_(0x3)                                             /**< (OPAMP_OPAMPCTRL1) R1 = 6R, R2 = 10R  */
#define   OPAMP_OPAMPCTRL1_POTMUX_4R_12R_Val  _U_(0x4)                                             /**< (OPAMP_OPAMPCTRL1) R1 = 4R, R2 = 12R  */
#define   OPAMP_OPAMPCTRL1_POTMUX_3R_13R_Val  _U_(0x5)                                             /**< (OPAMP_OPAMPCTRL1) R1 = 3R, R2 = 13R  */
#define   OPAMP_OPAMPCTRL1_POTMUX_2R_14R_Val  _U_(0x6)                                             /**< (OPAMP_OPAMPCTRL1) R1 = 2R, R2 = 14R  */
#define   OPAMP_OPAMPCTRL1_POTMUX_R_15R_Val   _U_(0x7)                                             /**< (OPAMP_OPAMPCTRL1) R1 = 1R, R2 = 15R  */
#define OPAMP_OPAMPCTRL1_POTMUX_14R_2R        (OPAMP_OPAMPCTRL1_POTMUX_14R_2R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL1) R1 = 14R, R2 = 2R Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_12R_4R        (OPAMP_OPAMPCTRL1_POTMUX_12R_4R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL1) R1 = 12R, R2 = 4R Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_8R_8R         (OPAMP_OPAMPCTRL1_POTMUX_8R_8R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL1) R1 = 8R, R2 = 8R Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_6R_10R        (OPAMP_OPAMPCTRL1_POTMUX_6R_10R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL1) R1 = 6R, R2 = 10R Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_4R_12R        (OPAMP_OPAMPCTRL1_POTMUX_4R_12R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL1) R1 = 4R, R2 = 12R Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_3R_13R        (OPAMP_OPAMPCTRL1_POTMUX_3R_13R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL1) R1 = 3R, R2 = 13R Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_2R_14R        (OPAMP_OPAMPCTRL1_POTMUX_2R_14R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL1) R1 = 2R, R2 = 14R Position  */
#define OPAMP_OPAMPCTRL1_POTMUX_R_15R         (OPAMP_OPAMPCTRL1_POTMUX_R_15R_Val << OPAMP_OPAMPCTRL1_POTMUX_Pos) /**< (OPAMP_OPAMPCTRL1) R1 = 1R, R2 = 15R Position  */
#define OPAMP_OPAMPCTRL1_MUXPOS_Pos           _U_(16)                                              /**< (OPAMP_OPAMPCTRL1) Positive Input Mux Selection Position */
#define OPAMP_OPAMPCTRL1_MUXPOS_Msk           (_U_(0xF) << OPAMP_OPAMPCTRL1_MUXPOS_Pos)            /**< (OPAMP_OPAMPCTRL1) Positive Input Mux Selection Mask */
#define OPAMP_OPAMPCTRL1_MUXPOS(value)        (OPAMP_OPAMPCTRL1_MUXPOS_Msk & ((value) << OPAMP_OPAMPCTRL1_MUXPOS_Pos))
#define   OPAMP_OPAMPCTRL1_MUXPOS_OA1POS_Val  _U_(0x0)                                             /**< (OPAMP_OPAMPCTRL1) Positive I/O pin  */
#define   OPAMP_OPAMPCTRL1_MUXPOS_OA1TAP_Val  _U_(0x1)                                             /**< (OPAMP_OPAMPCTRL1) Resistor ladder 1 taps  */
#define   OPAMP_OPAMPCTRL1_MUXPOS_REFERENCE_DAC_Val _U_(0x2)                                             /**< (OPAMP_OPAMPCTRL1) REFERENCE or DAC output  */
#define   OPAMP_OPAMPCTRL1_MUXPOS_GND_Val     _U_(0x3)                                             /**< (OPAMP_OPAMPCTRL1) Ground  */
#define   OPAMP_OPAMPCTRL1_MUXPOS_OA0OUT_Val  _U_(0x4)                                             /**< (OPAMP_OPAMPCTRL1) OPAMP0 output  */
#define OPAMP_OPAMPCTRL1_MUXPOS_OA1POS        (OPAMP_OPAMPCTRL1_MUXPOS_OA1POS_Val << OPAMP_OPAMPCTRL1_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL1) Positive I/O pin Position  */
#define OPAMP_OPAMPCTRL1_MUXPOS_OA1TAP        (OPAMP_OPAMPCTRL1_MUXPOS_OA1TAP_Val << OPAMP_OPAMPCTRL1_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL1) Resistor ladder 1 taps Position  */
#define OPAMP_OPAMPCTRL1_MUXPOS_REFERENCE_DAC (OPAMP_OPAMPCTRL1_MUXPOS_REFERENCE_DAC_Val << OPAMP_OPAMPCTRL1_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL1) REFERENCE or DAC output Position  */
#define OPAMP_OPAMPCTRL1_MUXPOS_GND           (OPAMP_OPAMPCTRL1_MUXPOS_GND_Val << OPAMP_OPAMPCTRL1_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL1) Ground Position  */
#define OPAMP_OPAMPCTRL1_MUXPOS_OA0OUT        (OPAMP_OPAMPCTRL1_MUXPOS_OA0OUT_Val << OPAMP_OPAMPCTRL1_MUXPOS_Pos) /**< (OPAMP_OPAMPCTRL1) OPAMP0 output Position  */
#define OPAMP_OPAMPCTRL1_MUXNEG_Pos           _U_(20)                                              /**< (OPAMP_OPAMPCTRL1) Negative Input Mux Selection Position */
#define OPAMP_OPAMPCTRL1_MUXNEG_Msk           (_U_(0xF) << OPAMP_OPAMPCTRL1_MUXNEG_Pos)            /**< (OPAMP_OPAMPCTRL1) Negative Input Mux Selection Mask */
#define OPAMP_OPAMPCTRL1_MUXNEG(value)        (OPAMP_OPAMPCTRL1_MUXNEG_Msk & ((value) << OPAMP_OPAMPCTRL1_MUXNEG_Pos))
#define   OPAMP_OPAMPCTRL1_MUXNEG_OA0NEG_Val  _U_(0x0)                                             /**< (OPAMP_OPAMPCTRL1) Negative I/O pin  */
#define   OPAMP_OPAMPCTRL1_MUXNEG_OA0TAP_Val  _U_(0x1)                                             /**< (OPAMP_OPAMPCTRL1) Resistor ladder 0 taps  */
#define   OPAMP_OPAMPCTRL1_MUXNEG_REFERENCE_DAC_Val _U_(0x2)                                             /**< (OPAMP_OPAMPCTRL1) REFERENCE or DAC output  */
#define   OPAMP_OPAMPCTRL1_MUXNEG_OA0OUT_Val  _U_(0x3)                                             /**< (OPAMP_OPAMPCTRL1) OPAMP0 output  */
#define OPAMP_OPAMPCTRL1_MUXNEG_OA0NEG        (OPAMP_OPAMPCTRL1_MUXNEG_OA0NEG_Val << OPAMP_OPAMPCTRL1_MUXNEG_Pos) /**< (OPAMP_OPAMPCTRL1) Negative I/O pin Position  */
#define OPAMP_OPAMPCTRL1_MUXNEG_OA0TAP        (OPAMP_OPAMPCTRL1_MUXNEG_OA0TAP_Val << OPAMP_OPAMPCTRL1_MUXNEG_Pos) /**< (OPAMP_OPAMPCTRL1) Resistor ladder 0 taps Position  */
#define OPAMP_OPAMPCTRL1_MUXNEG_REFERENCE_DAC (OPAMP_OPAMPCTRL1_MUXNEG_REFERENCE_DAC_Val << OPAMP_OPAMPCTRL1_MUXNEG_Pos) /**< (OPAMP_OPAMPCTRL1) REFERENCE or DAC output Position  */
#define OPAMP_OPAMPCTRL1_MUXNEG_OA0OUT        (OPAMP_OPAMPCTRL1_MUXNEG_OA0OUT_Val << OPAMP_OPAMPCTRL1_MUXNEG_Pos) /**< (OPAMP_OPAMPCTRL1) OPAMP0 output Position  */
#define OPAMP_OPAMPCTRL1_Msk                  _U_(0x00FFFFFE)                                      /**< (OPAMP_OPAMPCTRL1) Register Mask  */


/* -------- OPAMP_OPAMPCTRL2 : (OPAMP Offset: 0x0C) (R/W 32) OPAMP2 Control -------- */
#define OPAMP_OPAMPCTRL2_RESETVALUE           _U_(0x00)                                            /**<  (OPAMP_OPAMPCTRL2) OPAMP2 Control  Reset Value */

